beer_knowledge_base = {
    "Пиво": {
        "тип": ["Эль", "Лагер", "Стаут", "IPA", "Пшеничное"],
        "характеристики": ["горечь", "сладость", "аромат", "цвет", "крепость"]
    },
    "Эль": {
        "горечь": "средняя",
        "сладость": "умеренная",
        "аромат": "фруктовый, цветочный",
        "цвет": "янтарный",
        "крепость": "средняя",
    },
    "Лагер": {
        "горечь": "низкая",
        "сладость": "низкая",
        "аромат": "чистый, нейтральный",
        "цвет": "светлый",
        "крепость": "слабая",
    },
    "Стаут": {
        "горечь": "высокая",
        "сладость": "низкая",
        "аромат": "жжёный, кофейный, карамельный",
        "цвет": "тёмный",
        "крепость": "сильная",
    },
    "IPA": {
        "горечь": "высокая",
        "сладость": "низкая",
        "аромат": "цитрусовый, хвойный, хмелевой",
        "цвет": "золотистый",
        "крепость": "сильная",
    },
    "Пшеничное": {
        "горечь": "низкая",
        "сладость": "высокая",
        "аромат": "фруктовый, банановый, гвоздичный",
        "цвет": "светлый",
        "крепость": "средняя",
    }
}
