beer_knowledge_base = {
    "Пиво": {
        "тип": ["Лагер", "Стаут", "Индийский светлый эль", "Пшеничное", "Портер", "Трипель",
                "Бельгийский Витбир", "Светлый Эль", "Кёльш", "Бок", "Пильзенер",
                "Американский Эль", "Овсяный Стаут", "Барливайн", "Красный эль"],
        "характеристики": ["горечь", "сладость", "аромат", "цвет", "крепость", "страна"]
    },
    "Лагер": {
        "горечь": "низкая",
        "сладость": "низкая",
        "аромат": "хмелевой",
        "цвет": "светлый",
        "крепость": "слабая",
        "страна": "Германия или Бельгия"
    },
    "Стаут": {
        "горечь": "высокая",
        "сладость": "низкая",
        "аромат": "кофейный",
        "цвет": "тёмный",
        "крепость": "сильная",
        "страна": "Ирландия или Великобритания"
    },
    "Индийский светлый эль": {
        "горечь": "высокая",
        "сладость": "низкая",
        "аромат": "хмелевой",
        "цвет": "золотистый",
        "крепость": "сильная",
        "страна": "Великобритания"
    },
    "Пшеничное": {
        "горечь": "низкая",
        "сладость": "высокая",
        "аромат": "разное",
        "цвет": "светлый",
        "крепость": "средняя",
        "страна": "Германия или Бельгия"
    },
    "Портер": {
        "горечь": "средняя",
        "сладость": "умеренная",
        "аромат": "кофейный",
        "цвет": "тёмный",
        "крепость": "средняя",
        "страна": "Великобритания"
    },
    "Трипель": {
        "горечь": "средняя",
        "сладость": "высокая",
        "аромат": "пряный",
        "цвет": "светлый",
        "крепость": "сильная",
        "страна": "Бельгия"
    },
    "Бельгийский Витбир": {
        "горечь": "низкая",
        "сладость": "умеренная",
        "аромат": "пряный",
        "цвет": "светлый",
        "крепость": "слабая",
        "страна": "Бельгия"
    },
    "Светлый Эль": {
        "горечь": "низкая",
        "сладость": "умеренная",
        "аромат": "солодовый",
        "цвет": "светлый",
        "крепость": "средняя",
        "страна": "Великобритания"
    },
    "Кёльш": {
        "горечь": "низкая",
        "сладость": "умеренная",
        "аромат": "солодовый",
        "цвет": "светлый",
        "крепость": "средняя",
        "страна": "Германия"
    },
    "Бок": {
        "горечь": "средняя",
        "сладость": "высокая",
        "аромат": "карамельный",
        "цвет": "тёмный",
        "крепость": "средняя",
        "страна": "Германия"
    },
    "Пильзенер": {
        "горечь": "низкая",
        "сладость": "низкая",
        "аромат": "хмелевой",
        "цвет": "светлый",
        "крепость": "слабая",
        "страна": "Чехия или Германия"
    },
    "Американский Эль": {
        "горечь": "средняя",
        "сладость": "умеренная",
        "аромат": "солодовый",
        "цвет": "золотистый",
        "крепость": "средняя",
        "страна": "США"
    },
    "Овсяный Стаут": {
        "горечь": "средняя",
        "сладость": "высокая",
        "аромат": "овсяный",
        "цвет": "тёмный",
        "крепость": "средняя",
        "страна": "Ирландия"
    },
    "Барливайн": {
        "горечь": "низкая",
        "сладость": "высокая",
        "аромат": "солодовый",
        "цвет": "тёмный",
        "крепость": "сильная",
        "страна": "Бельгия или Германия"
    },
    "Красный эль": {
        "горечь": "средняя",
        "сладость": "умеренная",
        "аромат": "карамельный",
        "цвет": "красный",
        "крепость": "средняя",
        "страна": "Ирландия или Великобритания"
    }
}
